#!/usr/bin/env bash

##################################################
#构建docker image
##################################################
if [ "build" = "$1"  ]; then
    mvn spring-boot:build-image
fi
##################################################
#启动登录注册模块
##################################################

if [ "login" = "$1" ]; then
  nohup docker run -p 9090:8080 -t user-login:0.0.1-SNAPSHOT &
fi
##################################################
#启动消息管理模块
##################################################
if [ "msg" = "$1" ]; then
  nohup docker run -p 9080:8080 -t user-message:0.0.1-SNAPSHOT &
fi
